{
  "AI-Powered Immigration Assistance": "Assistance à l'immigration alimentée par l'IA",
  "Simplify Your Canadian Immigration Journey": "Simplifiez votre parcours d'immigration canadienne",
  "Our AI assistant guides you through every step of the study permit application process, in your language, with precision and ease.": "Notre assistant IA vous guide à travers chaque étape du processus de demande de permis d'études, dans votre langue, avec précision et facilité.",
  "Get Started": "Commencer",
  "Learn More": "En savoir plus",
  "IRCC Compliant": "Conforme à l'IRCC",
  "Data Secure": "Données sécurisées",
  "24/7 Support": "Support 24/7",
  "Multiple Languages": "Plusieurs langues",
  "Features": "Fonctionnalités",
  "Everything you need for a successful immigration application": "Tout ce dont vous avez besoin pour une demande d'immigration réussie",
  "AI Chat Assistant": "Assistant de chat IA",
  "Get personalized guidance through an intelligent conversation with our AI assistant. Ask questions, get instant answers, and receive step-by-step instructions.": "Obtenez des conseils personnalisés grâce à une conversation intelligente avec notre assistant IA. Posez des questions, obtenez des réponses instantanées et recevez des instructions étape par étape.",
  "Document Generation": "Génération de documents",
  "Automatically generate all required forms and documents based on your information. Save time and ensure accuracy with our smart form filling system.": "Générez automatiquement tous les formulaires et documents requis basés sur vos informations. Gagnez du temps et assurez la précision avec notre système intelligent de remplissage de formulaires.",
  "Multi-Language Support": "Support multilingue",
  "Access our platform in your preferred language. We support multiple languages to make the immigration process accessible to everyone.": "Accédez à notre plateforme dans votre langue préférée. Nous supportons plusieurs langues pour rendre le processus d'immigration accessible à tous.",
  "Real-Time Validation": "Validation en temps réel",
  "Get instant feedback on your application. Our system validates your information in real-time to catch errors before submission.": "Obtenez un retour instantané sur votre demande. Notre système valide vos informations en temps réel pour détecter les erreurs avant la soumission.",
  "Why Choose Us": "Pourquoi nous choisir",
  "Discover the advantages that make us the preferred choice for immigration assistance": "Découvrez les avantages qui font de nous le choix préféré pour l'assistance à l'immigration",
  "Fast Processing": "Traitement rapide",
  "Complete your application in minutes, not hours. Our streamlined process saves you valuable time.": "Complétez votre demande en minutes, pas en heures. Notre processus optimisé vous fait gagner un temps précieux.",
  "100% Accuracy": "100% de précision",
  "Our AI ensures your forms are filled correctly, reducing the risk of rejection due to errors.": "Notre IA s'assure que vos formulaires sont remplis correctement, réduisant le risque de rejet dû aux erreurs.",
  "Secure & Private": "Sécurisé et privé",
  "Your data is protected with enterprise-grade security. We never share your information with third parties.": "Vos données sont protégées par une sécurité de niveau entreprise. Nous ne partageons jamais vos informations avec des tiers.",
  "Expert Support": "Support expert",
  "Get help from immigration experts when you need it. Our team is here to support you throughout the process.": "Obtenez l'aide d'experts en immigration quand vous en avez besoin. Notre équipe est là pour vous soutenir tout au long du processus.",
  "Cost Effective": "Rentable",
  "Save thousands on immigration consultants. Our AI-powered platform provides professional assistance at a fraction of the cost.": "Économisez des milliers sur les consultants en immigration. Notre plateforme alimentée par l'IA fournit une assistance professionnelle à une fraction du coût.",
  "Personal Information": "Informations personnelles",
  "Tell me about yourself for your study permit application.": "Parlez-moi de vous pour votre demande de permis d'études.",
  "✅ Interview completed! Your forms are ready for download.": "✅ Entretien terminé ! Vos formulaires sont prêts à télécharger.",
  "Estimated time remaining:": "Temps restant estimé :",
  "minutes": "minutes",
  "Toggle answers sidebar": "Basculer la barre latérale des réponses",
  "Show Answers": "Afficher les réponses",
  "Hide Answers": "Masquer les réponses",
  "Answers": "Réponses",
  "Forms Ready": "Formulaires prêts",
  "Ready": "Prêt",
  "Download your completed forms": "Télécharger vos formulaires complétés",
  "Complete the interview to download forms": "Terminez l'entretien pour télécharger les formulaires",
  "Download Forms": "Télécharger les formulaires",
  "Download": "Télécharger",
  "Thinking...": "Réflexion...",
  "Type your message... (Shift+Enter for new line)": "Tapez votre message... (Shift+Entrée pour une nouvelle ligne)",
  "Send": "Envoyer",
  "Your information is secure and will only be used for your immigration application.": "Vos informations sont sécurisées et ne seront utilisées que pour votre demande d'immigration.",
  "Your Answers": "Vos réponses",
  "No answers yet. Start the interview to see your responses here.": "Aucune réponse pour le moment. Commencez l'entretien pour voir vos réponses ici.",
  "Show full question": "Afficher la question complète",
  "Edit answer": "Modifier la réponse",
  "Enter your answer...": "Entrez votre réponse...",
  "Save": "Enregistrer",
  "Cancel": "Annuler",
  "Sorry, I encountered an error. Please try again.": "Désolé, j'ai rencontré une erreur. Veuillez réessayer.",
  "Select Application Type": "Sélectionner le type de demande",
  "Choose the type of immigration application you'd like to start. Each type has different requirements and processes.": "Choisissez le type de demande d'immigration que vous souhaitez commencer. Chaque type a des exigences et des processus différents.",
  "Please Login": "Veuillez vous connecter",
  "You need to be logged in to create or continue an application. Please login with your account or register if you don't have one.": "Vous devez être connecté pour créer ou continuer une demande. Veuillez vous connecter avec votre compte ou vous inscrire si vous n'en avez pas.",
  "Register": "S'inscrire",
  "Login to Continue": "Se connecter pour continuer",
  "Study Permit": "Permis d'études",
  "For international students": "Pour les étudiants internationaux",
  "Permanent Residence": "Résidence permanente",
  "For long-term immigration": "Pour l'immigration à long terme",
  "Resources": "Ressources",
  "Consultant Connect": "Connexion consultant",
  "About Us": "À propos de nous",
  "Making Canadian immigration simple through AI assistance": "Rendre l'immigration canadienne simple grâce à l'assistance IA",
  "Privacy": "Confidentialité",
  "Terms": "Conditions",
  "Sign In": "Se connecter",
  "Already have an account?": "Vous avez déjà un compte ?",
  "Create Account": "Créer un compte",
  "Don't have an account?": "Vous n'avez pas de compte ?",
  "Email": "E-mail",
  "Password": "Mot de passe",
  "Login": "Connexion",
  "Forgot your password?": "Mot de passe oublié ?",
  "Sign Up": "S'inscrire",
  "Confirm Password": "Confirmer le mot de passe",
  "I agree to the Terms of Service and Privacy Policy": "J'accepte les conditions de service et la politique de confidentialité",
  "Already have an account? Sign In": "Vous avez déjà un compte ? Se connecter",
  "Our Features": "Nos fonctionnalités",
  "Our comprehensive platform combines AI technology with immigration expertise to streamline your application process.": "Notre plateforme complète combine la technologie IA avec l'expertise en immigration pour rationaliser votre processus de demande.",
  "Intelligent Interviews": "Entretiens intelligents",
  "Conversational AI asks all the right questions to gather your information, adapting to your responses in real-time": "L'IA conversationnelle pose toutes les bonnes questions pour recueillir vos informations, s'adaptant à vos réponses en temps réel",
  "Automatic Form Filling": "Remplissage automatique de formulaires",
  "No more repetitive form completion - our system fills out all required forms with your information": "Plus de remplissage répétitif de formulaires - notre système remplit tous les formulaires requis avec vos informations",
  "Error Tracking": "Suivi des erreurs",
  "AI identifies potential issues or inconsistencies in your application before submission": "L'IA identifie les problèmes potentiels ou les incohérences dans votre demande avant la soumission",
  "Why Choose Immentra": "Pourquoi choisir Immentra",
  "Our platform offers unique advantages that make your immigration journey smooth and successful.": "Notre plateforme offre des avantages uniques qui rendent votre parcours d'immigration fluide et réussi.",
  "Fast & Efficient": "Rapide et efficace",
  "Complete your application in hours instead of weeks. Our streamlined process eliminates delays.": "Complétez votre demande en heures au lieu de semaines. Notre processus optimisé élimine les retards.",
  "100% Accurate": "100% précis",
  "Our AI ensures all forms are filled correctly, reducing rejection risks due to common errors.": "Notre IA s'assure que tous les formulaires sont remplis correctement, réduisant les risques de rejet dus aux erreurs courantes.",
  "Security First": "Sécurité d'abord",
  "Your data is protected with bank-level encryption and is never shared with third parties.": "Vos données sont protégées par un chiffrement de niveau bancaire et ne sont jamais partagées avec des tiers.",
  "Affordable": "Abordable",
  "Save thousands compared to traditional immigration services while getting premium results.": "Économisez des milliers par rapport aux services d'immigration traditionnels tout en obtenant des résultats premium.",
  "Multi-Language": "Multi-langue",
  "Get assistance in your preferred language: English, French, Vietnamese, or Mandarin Chinese.": "Obtenez de l'aide dans votre langue préférée : anglais, français, vietnamien ou mandarin chinois.",
  "Simple Process": "Processus simple",
  "How Immentra Works": "Comment fonctionne Immentra",
  "Your journey to Canada made simple in just three easy steps.": "Votre voyage vers le Canada simplifié en seulement trois étapes faciles.",
  "Answer Simple Questions": "Répondez à des questions simples",
  "Our AI assistant will guide you through a series of easy-to-answer questions about your personal information, work experience, and immigration goals.": "Notre assistant IA vous guidera à travers une série de questions faciles à répondre sur vos informations personnelles, votre expérience de travail et vos objectifs d'immigration.",
  "Review Your Information": "Examinez vos informations",
  "Once you've provided all necessary details, our system will compile and organize your information for review, ensuring everything is accurate.": "Une fois que vous avez fourni tous les détails nécessaires, notre système compilera et organisera vos informations pour examen, en s'assurant que tout est précis.",
  "Download Completed Forms": "Téléchargez les formulaires complétés",
  "After reviewing your information, our system generates properly filled application forms that you can download, print, and submit to Canadian immigration authorities.": "Après avoir examiné vos informations, notre système génère des formulaires de demande correctement remplis que vous pouvez télécharger, imprimer et soumettre aux autorités d'immigration canadiennes.",
  "Start Your Journey": "Commencez votre voyage",
  "Ready to make Canada your new home?": "Prêt à faire du Canada votre nouvelle maison ?",
  "Get started with Immentra — a smarter way to complete your Canadian study permit application using AI-driven guidance and form automation.": "Commencez avec Immentra — une façon plus intelligente de compléter votre demande de permis d'études canadien en utilisant des conseils alimentés par l'IA et l'automatisation des formulaires.",
  "For international students who want to study in Canada": "Pour les étudiants internationaux qui souhaitent étudier au Canada",
  "Navigate the Study permit application process with AI assistance.": "Naviguez dans le processus de demande de permis d'études avec l'assistance IA.",
  "For temporary work opportunities in Canada": "Pour les opportunités de travail temporaire au Canada",
  "Navigate the work permit application process with AI assistance.": "Naviguez dans le processus de demande de permis de travail avec l'assistance IA.",
  "For long-term immigration to Canada": "Pour l'immigration à long terme au Canada",
  "Comprehensive guidance for permanent residence applications.": "Conseils complets pour les demandes de résidence permanente.",
  "Creating...": "Création...",
  "Select": "Sélectionner",
  "Coming Soon": "Bientôt disponible",
  "Starting Process...": "Démarrage du processus...",
  "Start Process": "Démarrer le processus",
  "Please login first": "Veuillez d'abord vous connecter",
  "Connect with licensed immigration consultants for professional advice when needed.": "Connectez-vous avec des consultants en immigration agréés pour des conseils professionnels lorsque nécessaire."
}
