{
  "AI-Powered Immigration Assistance": "AI-संचालित आप्रवासन सहायता",
  "Simplify Your Canadian Immigration Journey": "अपनी कनाडाई आप्रवासन यात्रा को सरल बनाएं",
  "Our AI assistant guides you through every step of the study permit application process, in your language, with precision and ease.": "हमारा AI सहायक आपकी भाषा में, सटीकता और आसानी के साथ अध्ययन परमिट आवेदन प्रक्रिया के हर कदम पर आपका मार्गदर्शन करता है।",
  "Get Started": "शुरू करें",
  "Learn More": "और जानें",
  "IRCC Compliant": "IRCC अनुपालन",
  "Data Secure": "डेटा सुरक्षित",
  "24/7 Support": "24/7 सहायता",
  "Multiple Languages": "कई भाषाएं",
  "Features": "सुविधाएं",
  "Everything you need for a successful immigration application": "सफल आप्रवासन आवेदन के लिए आपको जो कुछ चाहिए",
  "AI Chat Assistant": "AI चैट सहायक",
  "Get personalized guidance through an intelligent conversation with our AI assistant. Ask questions, get instant answers, and receive step-by-step instructions.": "हमारे AI सहायक के साथ बुद्धिमान बातचीत के माध्यम से व्यक्तिगत मार्गदर्शन प्राप्त करें। प्रश्न पूछें, तुरंत उत्तर प्राप्त करें और चरण-दर-चरण निर्देश प्राप्त करें।",
  "Document Generation": "दस्तावेज़ जनरेशन",
  "Automatically generate all required forms and documents based on your information. Save time and ensure accuracy with our smart form filling system.": "आपकी जानकारी के आधार पर सभी आवश्यक फॉर्म और दस्तावेज़ स्वचालित रूप से उत्पन्न करें। हमारे स्मार्ट फॉर्म भरने वाले सिस्टम के साथ समय बचाएं और सटीकता सुनिश्चित करें।",
  "Multi-Language Support": "बहुभाषी समर्थन",
  "Access our platform in your preferred language. We support multiple languages to make the immigration process accessible to everyone.": "अपनी पसंदीदा भाषा में हमारे प्लेटफॉर्म तक पहुंचें। हम कई भाषाओं का समर्थन करते हैं ताकि आप्रवासन प्रक्रिया सभी के लिए सुलभ हो।",
  "Real-Time Validation": "रीयल-टाइम वैलिडेशन",
  "Get instant feedback on your application. Our system validates your information in real-time to catch errors before submission.": "अपने आवेदन पर तुरंत प्रतिक्रिया प्राप्त करें। हमारा सिस्टम आपकी जानकारी को रीयल-टाइम में वैलिडेट करता है ताकि सबमिशन से पहले त्रुटियों को पकड़ सके।",
  "Why Choose Us": "हमें क्यों चुनें",
  "Discover the advantages that make us the preferred choice for immigration assistance": "उन लाभों की खोज करें जो हमें आप्रवासन सहायता के लिए पसंदीदा विकल्प बनाते हैं",
  "Fast Processing": "तेज़ प्रसंस्करण",
  "Complete your application in minutes, not hours. Our streamlined process saves you valuable time.": "घंटों में नहीं, मिनटों में अपना आवेदन पूरा करें। हमारी सरल प्रक्रिया आपका कीमती समय बचाती है।",
  "100% Accuracy": "100% सटीकता",
  "Our AI ensures your forms are filled correctly, reducing the risk of rejection due to errors.": "हमारा AI सुनिश्चित करता है कि आपके फॉर्म सही तरीके से भरे गए हैं, त्रुटियों के कारण अस्वीकृति का जोखिम कम करता है।",
  "Secure & Private": "सुरक्षित और निजी",
  "Your data is protected with enterprise-grade security. We never share your information with third parties.": "आपका डेटा एंटरप्राइज-ग्रेड सुरक्षा के साथ संरक्षित है। हम कभी भी आपकी जानकारी तृतीय पक्षों के साथ साझा नहीं करते।",
  "Expert Support": "विशेषज्ञ सहायता",
  "Get help from immigration experts when you need it. Our team is here to support you throughout the process.": "जब आपको जरूरत हो तो आप्रवासन विशेषज्ञों से मदद प्राप्त करें। हमारी टीम पूरी प्रक्रिया में आपका समर्थन करने के लिए यहां है।",
  "Cost Effective": "लागत प्रभावी",
  "Save thousands on immigration consultants. Our AI-powered platform provides professional assistance at a fraction of the cost.": "आप्रवासन सलाहकारों पर हजारों बचाएं। हमारा AI-संचालित प्लेटफॉर्म कम लागत पर पेशेवर सहायता प्रदान करता है।",
  "Personal Information": "व्यक्तिगत जानकारी",
  "Tell me about yourself for your study permit application.": "अपने अध्ययन परमिट आवेदन के लिए मुझे अपने बारे में बताएं।",
  "✅ Interview completed! Your forms are ready for download.": "✅ साक्षात्कार पूरा हुआ! आपके फॉर्म डाउनलोड के लिए तैयार हैं।",
  "Estimated time remaining:": "अनुमानित शेष समय:",
  "minutes": "मिनट",
  "Toggle answers sidebar": "उत्तर साइडबार टॉगल करें",
  "Show Answers": "उत्तर दिखाएं",
  "Hide Answers": "उत्तर छिपाएं",
  "Answers": "उत्तर",
  "Forms Ready": "फॉर्म तैयार",
  "Ready": "तैयार",
  "Download your completed forms": "अपने पूर्ण फॉर्म डाउनलोड करें",
  "Complete the interview to download forms": "फॉर्म डाउनलोड करने के लिए साक्षात्कार पूरा करें",
  "Download Forms": "फॉर्म डाउनलोड करें",
  "Download": "डाउनलोड",
  "Thinking...": "सोच रहा है...",
  "Type your message... (Shift+Enter for new line)": "अपना संदेश टाइप करें... (नई पंक्ति के लिए Shift+Enter)",
  "Send": "भेजें",
  "Your information is secure and will only be used for your immigration application.": "आपकी जानकारी सुरक्षित है और केवल आपके आप्रवासन आवेदन के लिए उपयोग की जाएगी।",
  "Your Answers": "आपके उत्तर",
  "No answers yet. Start the interview to see your responses here.": "अभी तक कोई उत्तर नहीं। अपने उत्तर यहां देखने के लिए साक्षात्कार शुरू करें।",
  "Show full question": "पूरा प्रश्न दिखाएं",
  "Edit answer": "उत्तर संपादित करें",
  "Enter your answer...": "अपना उत्तर दर्ज करें...",
  "Save": "सहेजें",
  "Cancel": "रद्द करें",
  "Sorry, I encountered an error. Please try again.": "क्षमा करें, मुझे एक त्रुटि का सामना करना पड़ा। कृपया पुनः प्रयास करें।",
  "Select Application Type": "आवेदन प्रकार चुनें",
  "Choose the type of immigration application you'd like to start. Each type has different requirements and processes.": "उस आप्रवासन आवेदन का प्रकार चुनें जिसे आप शुरू करना चाहते हैं। प्रत्येक प्रकार की अलग-अलग आवश्यकताएं और प्रक्रियाएं हैं।",
  "Please Login": "कृपया लॉगिन करें",
  "You need to be logged in to create or continue an application. Please login with your account or register if you don't have one.": "आवेदन बनाने या जारी रखने के लिए आपको लॉगिन करना होगा। कृपया अपने खाते से लॉगिन करें या यदि आपके पास नहीं है तो पंजीकरण करें।",
  "Register": "पंजीकरण",
  "Login to Continue": "जारी रखने के लिए लॉगिन करें",
  "Study Permit": "अध्ययन परमिट",
  "For international students": "अंतरराष्ट्रीय छात्रों के लिए",
  "Permanent Residence": "स्थायी निवास",
  "For long-term immigration": "दीर्घकालिक आप्रवासन के लिए",
  "Resources": "संसाधन",
  "Consultant Connect": "सलाहकार कनेक्ट",
  "About Us": "हमारे बारे में",
  "Making Canadian immigration simple through AI assistance": "AI सहायता के माध्यम से कनाडाई आप्रवासन को सरल बनाना",
  "Privacy": "गोपनीयता",
  "Terms": "शर्तें",
  "Sign In": "साइन इन",
  "Already have an account?": "पहले से ही खाता है?",
  "Create Account": "खाता बनाएं",
  "Don't have an account?": "खाता नहीं है?",
  "Email": "ईमेल",
  "Password": "पासवर्ड",
  "Login": "लॉगिन",
  "Forgot your password?": "पासवर्ड भूल गए?",
  "Sign Up": "साइन अप",
  "Confirm Password": "पासवर्ड की पुष्टि करें",
  "I agree to the Terms of Service and Privacy Policy": "मैं सेवा की शर्तों और गोपनीयता नीति से सहमत हूं",
  "Already have an account? Sign In": "पहले से ही खाता है? साइन इन करें",
  "Our Features": "हमारी विशेषताएं",
  "Our comprehensive platform combines AI technology with immigration expertise to streamline your application process.": "हमारा व्यापक प्लेटफॉर्म आपके आवेदन प्रक्रिया को सुव्यवस्थित करने के लिए AI तकनीक को आप्रवासन विशेषज्ञता के साथ जोड़ता है।",
  "Intelligent Interviews": "बुद्धिमान साक्षात्कार",
  "Conversational AI asks all the right questions to gather your information, adapting to your responses in real-time": "संवादी AI आपकी जानकारी एकत्र करने के लिए सभी सही प्रश्न पूछता है, आपकी प्रतिक्रियाओं के अनुसार वास्तविक समय में अनुकूलन करता है",
  "Automatic Form Filling": "स्वचालित फॉर्म भरना",
  "No more repetitive form completion - our system fills out all required forms with your information": "अब दोहराव वाला फॉर्म पूरा करने की आवश्यकता नहीं - हमारी प्रणाली आपकी जानकारी के साथ सभी आवश्यक फॉर्म भरती है",
  "Error Tracking": "त्रुटि ट्रैकिंग",
  "AI identifies potential issues or inconsistencies in your application before submission": "AI आपके आवेदन में संभावित समस्याओं या असंगतताओं की पहचान करता है जमा करने से पहले",
  "Why Choose Immentra": "Immentra को क्यों चुनें",
  "Our platform offers unique advantages that make your immigration journey smooth and successful.": "हमारा प्लेटफॉर्म अनूठे लाभ प्रदान करता है जो आपकी आप्रवासन यात्रा को सहज और सफल बनाते हैं।",
  "Fast & Efficient": "तेज और कुशल",
  "Complete your application in hours instead of weeks. Our streamlined process eliminates delays.": "सप्ताहों के बजाय घंटों में अपना आवेदन पूरा करें। हमारी सुव्यवस्थित प्रक्रिया देरी को समाप्त करती है।",
  "100% Accurate": "100% सटीक",
  "Our AI ensures all forms are filled correctly, reducing rejection risks due to common errors.": "हमारा AI सुनिश्चित करता है कि सभी फॉर्म सही तरीके से भरे गए हैं, सामान्य त्रुटियों के कारण अस्वीकृति के जोखिम को कम करता है।",
  "Security First": "सुरक्षा पहले",
  "Your data is protected with bank-level encryption and is never shared with third parties.": "आपका डेटा बैंक-स्तरीय एन्क्रिप्शन के साथ संरक्षित है और कभी भी तृतीय पक्षों के साथ साझा नहीं किया जाता।",
  "Affordable": "सस्ती",
  "Save thousands compared to traditional immigration services while getting premium results.": "प्रीमियम परिणाम प्राप्त करते हुए पारंपरिक आप्रवासन सेवाओं की तुलना में हजारों बचाएं।",
  "Multi-Language": "बहुभाषी",
  "Get assistance in your preferred language: English, French, Vietnamese, or Mandarin Chinese.": "अपनी पसंदीदा भाषा में सहायता प्राप्त करें: अंग्रेजी, फ्रेंच, वियतनामी, या मंदारिन चीनी।",
  "Simple Process": "सरल प्रक्रिया",
  "How Immentra Works": "Immentra कैसे काम करता है",
  "Your journey to Canada made simple in just three easy steps.": "कनाडा की आपकी यात्रा को केवल तीन आसान चरणों में सरल बनाया गया।",
  "Answer Simple Questions": "सरल प्रश्नों का उत्तर दें",
  "Our AI assistant will guide you through a series of easy-to-answer questions about your personal information, work experience, and immigration goals.": "हमारा AI सहायक आपको आपकी व्यक्तिगत जानकारी, कार्य अनुभव और आप्रवासन लक्ष्यों के बारे में आसानी से उत्तर देने योग्य प्रश्नों की श्रृंखला के माध्यम से मार्गदर्शन करेगा।",
  "Review Your Information": "अपनी जानकारी की समीक्षा करें",
  "Once you've provided all necessary details, our system will compile and organize your information for review, ensuring everything is accurate.": "एक बार जब आप सभी आवश्यक विवरण प्रदान कर देते हैं, तो हमारी प्रणाली समीक्षा के लिए आपकी जानकारी को संकलित और व्यवस्थित करेगी, यह सुनिश्चित करते हुए कि सब कुछ सटीक है।",
  "Download Completed Forms": "पूर्ण फॉर्म डाउनलोड करें",
  "After reviewing your information, our system generates properly filled application forms that you can download, print, and submit to Canadian immigration authorities.": "आपकी जानकारी की समीक्षा करने के बाद, हमारी प्रणाली सही तरीके से भरे गए आवेदन फॉर्म उत्पन्न करती है जिन्हें आप डाउनलोड, प्रिंट और कनाडाई आप्रवासन अधिकारियों को जमा कर सकते हैं।",
  "Start Your Journey": "अपनी यात्रा शुरू करें",
  "Ready to make Canada your new home?": "कनाडा को अपना नया घर बनाने के लिए तैयार हैं?",
  "Get started with Immentra — a smarter way to complete your Canadian study permit application using AI-driven guidance and form automation.": "Immentra के साथ शुरू करें — AI-संचालित मार्गदर्शन और फॉर्म स्वचालन का उपयोग करके अपने कनाडाई अध्ययन परमिट आवेदन को पूरा करने का एक स्मार्ट तरीका।",
  "For international students who want to study in Canada": "कनाडा में पढ़ना चाहने वाले अंतरराष्ट्रीय छात्रों के लिए",
  "Navigate the Study permit application process with AI assistance.": "AI सहायता के साथ अध्ययन परमिट आवेदन प्रक्रिया का नेविगेट करें।",
  "For temporary work opportunities in Canada": "कनाडा में अस्थायी कार्य अवसरों के लिए",
  "Navigate the work permit application process with AI assistance.": "AI सहायता के साथ कार्य परमिट आवेदन प्रक्रिया का नेविगेट करें।",
  "For long-term immigration to Canada": "कनाडा में दीर्घकालिक आप्रवासन के लिए",
  "Comprehensive guidance for permanent residence applications.": "स्थायी निवास आवेदनों के लिए व्यापक मार्गदर्शन।",
  "Creating...": "बना रहा है...",
  "Select": "चुनें",
  "Coming Soon": "जल्द आ रहा है",
  "Starting Process...": "प्रक्रिया शुरू हो रही है...",
  "Start Process": "प्रक्रिया शुरू करें",
  "Please login first": "कृपया पहले लॉगिन करें",
  "Connect with licensed immigration consultants for professional advice when needed.": "जब आवश्यक हो तो पेशेवर सलाह के लिए लाइसेंस प्राप्त आप्रवासन सलाहकारों से जुड़ें।"
}
