{
  "AI-Powered Immigration Assistance": "Hỗ trợ nhập cư được hỗ trợ bởi AI",
  "Simplify Your Canadian Immigration Journey": "Đơn giản hóa hành trình nhập cư Canada của bạn",
  "Our AI assistant guides you through every step of the study permit application process, in your language, with precision and ease.": "Trợ lý AI của chúng tôi hướng dẫn bạn qua từng bước của quy trình xin giấy phép học tập, bằng ngôn ngữ của bạn, với độ chính xác và dễ dàng.",
  "Get Started": "Bắt đầu",
  "Learn More": "Tìm hiểu thêm",
  "IRCC Compliant": "Tuân thủ IRCC",
  "Data Secure": "Dữ liệu an toàn",
  "24/7 Support": "Hỗ trợ 24/7",
  "Multiple Languages": "Đa ngôn ngữ",
  "Features": "Tính năng",
  "Everything you need for a successful immigration application": "Tất cả những gì bạn cần cho một đơn xin nhập cư thành công",
  "AI Chat Assistant": "Trợ lý chat AI",
  "Get personalized guidance through an intelligent conversation with our AI assistant. Ask questions, get instant answers, and receive step-by-step instructions.": "Nhận hướng dẫn cá nhân hóa thông qua cuộc trò chuyện thông minh với trợ lý AI của chúng tôi. Đặt câu hỏi, nhận câu trả lời tức thì và nhận hướng dẫn từng bước.",
  "Document Generation": "Tạo tài liệu",
  "Automatically generate all required forms and documents based on your information. Save time and ensure accuracy with our smart form filling system.": "Tự động tạo tất cả các biểu mẫu và tài liệu cần thiết dựa trên thông tin của bạn. Tiết kiệm thời gian và đảm bảo độ chính xác với hệ thống điền biểu mẫu thông minh của chúng tôi.",
  "Multi-Language Support": "Hỗ trợ đa ngôn ngữ",
  "Access our platform in your preferred language. We support multiple languages to make the immigration process accessible to everyone.": "Truy cập nền tảng của chúng tôi bằng ngôn ngữ bạn ưa thích. Chúng tôi hỗ trợ nhiều ngôn ngữ để làm cho quy trình nhập cư dễ tiếp cận với mọi người.",
  "Real-Time Validation": "Xác thực thời gian thực",
  "Get instant feedback on your application. Our system validates your information in real-time to catch errors before submission.": "Nhận phản hồi tức thì về đơn của bạn. Hệ thống của chúng tôi xác thực thông tin của bạn theo thời gian thực để phát hiện lỗi trước khi gửi.",
  "Why Choose Us": "Tại sao chọn chúng tôi",
  "Discover the advantages that make us the preferred choice for immigration assistance": "Khám phá những lợi thế khiến chúng tôi trở thành lựa chọn ưa thích cho hỗ trợ nhập cư",
  "Fast Processing": "Xử lý nhanh",
  "Complete your application in minutes, not hours. Our streamlined process saves you valuable time.": "Hoàn thành đơn của bạn trong vài phút, không phải vài giờ. Quy trình tối ưu của chúng tôi tiết kiệm thời gian quý báu cho bạn.",
  "100% Accuracy": "100% chính xác",
  "Our AI ensures your forms are filled correctly, reducing the risk of rejection due to errors.": "AI của chúng tôi đảm bảo các biểu mẫu của bạn được điền chính xác, giảm nguy cơ bị từ chối do lỗi.",
  "Secure & Private": "An toàn và riêng tư",
  "Your data is protected with enterprise-grade security. We never share your information with third parties.": "Dữ liệu của bạn được bảo vệ bằng bảo mật cấp doanh nghiệp. Chúng tôi không bao giờ chia sẻ thông tin của bạn với bên thứ ba.",
  "Expert Support": "Hỗ trợ chuyên gia",
  "Get help from immigration experts when you need it. Our team is here to support you throughout the process.": "Nhận sự trợ giúp từ các chuyên gia nhập cư khi bạn cần. Đội ngũ của chúng tôi ở đây để hỗ trợ bạn trong suốt quá trình.",
  "Cost Effective": "Hiệu quả chi phí",
  "Save thousands on immigration consultants. Our AI-powered platform provides professional assistance at a fraction of the cost.": "Tiết kiệm hàng nghìn cho các tư vấn viên nhập cư. Nền tảng được hỗ trợ bởi AI của chúng tôi cung cấp hỗ trợ chuyên nghiệp với chi phí thấp hơn nhiều.",
  "Personal Information": "Thông tin cá nhân",
  "Tell me about yourself for your study permit application.": "Hãy cho tôi biết về bạn cho đơn xin giấy phép học tập của bạn.",
  "✅ Interview completed! Your forms are ready for download.": "✅ Phỏng vấn hoàn thành! Biểu mẫu của bạn đã sẵn sàng để tải xuống.",
  "Estimated time remaining:": "Thời gian còn lại ước tính:",
  "minutes": "phút",
  "Toggle answers sidebar": "Chuyển đổi thanh bên câu trả lời",
  "Show Answers": "Hiển thị câu trả lời",
  "Hide Answers": "Ẩn câu trả lời",
  "Answers": "Câu trả lời",
  "Forms Ready": "Biểu mẫu sẵn sàng",
  "Ready": "Sẵn sàng",
  "Download your completed forms": "Tải xuống biểu mẫu đã hoàn thành của bạn",
  "Complete the interview to download forms": "Hoàn thành phỏng vấn để tải xuống biểu mẫu",
  "Download Forms": "Tải xuống biểu mẫu",
  "Download": "Tải xuống",
  "Thinking...": "Đang suy nghĩ...",
  "Type your message... (Shift+Enter for new line)": "Nhập tin nhắn của bạn... (Shift+Enter để xuống dòng)",
  "Send": "Gửi",
  "Your information is secure and will only be used for your immigration application.": "Thông tin của bạn được bảo mật và chỉ được sử dụng cho đơn xin nhập cư của bạn.",
  "Your Answers": "Câu trả lời của bạn",
  "No answers yet. Start the interview to see your responses here.": "Chưa có câu trả lời nào. Bắt đầu phỏng vấn để xem câu trả lời của bạn ở đây.",
  "Show full question": "Hiển thị câu hỏi đầy đủ",
  "Edit answer": "Chỉnh sửa câu trả lời",
  "Enter your answer...": "Nhập câu trả lời của bạn...",
  "Save": "Lưu",
  "Cancel": "Hủy",
  "Sorry, I encountered an error. Please try again.": "Xin lỗi, tôi đã gặp lỗi. Vui lòng thử lại.",
  "Select Application Type": "Chọn loại đơn",
  "Choose the type of immigration application you'd like to start. Each type has different requirements and processes.": "Chọn loại đơn xin nhập cư bạn muốn bắt đầu. Mỗi loại có yêu cầu và quy trình khác nhau.",
  "Please Login": "Vui lòng đăng nhập",
  "You need to be logged in to create or continue an application. Please login with your account or register if you don't have one.": "Bạn cần đăng nhập để tạo hoặc tiếp tục đơn. Vui lòng đăng nhập bằng tài khoản của bạn hoặc đăng ký nếu bạn chưa có.",
  "Register": "Đăng ký",
  "Login to Continue": "Đăng nhập để tiếp tục",
  "Study Permit": "Giấy phép học tập",
  "For international students": "Dành cho sinh viên quốc tế",
  "Permanent Residence": "Thường trú nhân",
  "For long-term immigration": "Dành cho nhập cư dài hạn",
  "Resources": "Tài nguyên",
  "Consultant Connect": "Kết nối tư vấn viên",
  "About Us": "Về chúng tôi",
  "Making Canadian immigration simple through AI assistance": "Làm cho nhập cư Canada đơn giản thông qua hỗ trợ AI",
  "Privacy": "Quyền riêng tư",
  "Terms": "Điều khoản",
  "Sign In": "Đăng nhập",
  "Already have an account?": "Đã có tài khoản?",
  "Create Account": "Tạo tài khoản",
  "Don't have an account?": "Chưa có tài khoản?",
  "Email": "E-mail",
  "Password": "Mật khẩu",
  "Login": "Đăng nhập",
  "Forgot your password?": "Quên mật khẩu?",
  "Sign Up": "Đăng ký",
  "Confirm Password": "Xác nhận mật khẩu",
  "I agree to the Terms of Service and Privacy Policy": "Tôi đồng ý với Điều khoản dịch vụ và Chính sách bảo mật",
  "Already have an account? Sign In": "Đã có tài khoản? Đăng nhập",
  "Our Features": "Tính năng của chúng tôi",
  "Our comprehensive platform combines AI technology with immigration expertise to streamline your application process.": "Nền tảng toàn diện của chúng tôi kết hợp công nghệ AI với chuyên môn nhập cư để tối ưu hóa quy trình đơn của bạn.",
  "Intelligent Interviews": "Phỏng vấn thông minh",
  "Conversational AI asks all the right questions to gather your information, adapting to your responses in real-time": "AI trò chuyện đặt tất cả các câu hỏi đúng để thu thập thông tin của bạn, thích ứng với câu trả lời của bạn theo thời gian thực",
  "Automatic Form Filling": "Điền biểu mẫu tự động",
  "No more repetitive form completion - our system fills out all required forms with your information": "Không còn điền biểu mẫu lặp đi lặp lại - hệ thống của chúng tôi điền tất cả các biểu mẫu cần thiết với thông tin của bạn",
  "Error Tracking": "Theo dõi lỗi",
  "AI identifies potential issues or inconsistencies in your application before submission": "AI xác định các vấn đề tiềm ẩn hoặc không nhất quán trong đơn của bạn trước khi gửi",
  "Why Choose Immentra": "Tại sao chọn Immentra",
  "Our platform offers unique advantages that make your immigration journey smooth and successful.": "Nền tảng của chúng tôi cung cấp những lợi thế độc đáo giúp hành trình nhập cư của bạn suôn sẻ và thành công.",
  "Fast & Efficient": "Nhanh chóng và hiệu quả",
  "Complete your application in hours instead of weeks. Our streamlined process eliminates delays.": "Hoàn thành đơn của bạn trong vài giờ thay vì vài tuần. Quy trình tối ưu của chúng tôi loại bỏ sự chậm trễ.",
  "100% Accurate": "100% chính xác",
  "Our AI ensures all forms are filled correctly, reducing rejection risks due to common errors.": "AI của chúng tôi đảm bảo tất cả biểu mẫu được điền chính xác, giảm nguy cơ bị từ chối do lỗi thường gặp.",
  "Security First": "Bảo mật trước tiên",
  "Your data is protected with bank-level encryption and is never shared with third parties.": "Dữ liệu của bạn được bảo vệ bằng mã hóa cấp ngân hàng và không bao giờ được chia sẻ với bên thứ ba.",
  "Affordable": "Giá cả phải chăng",
  "Save thousands compared to traditional immigration services while getting premium results.": "Tiết kiệm hàng nghìn so với dịch vụ nhập cư truyền thống trong khi vẫn có được kết quả cao cấp.",
  "Multi-Language": "Đa ngôn ngữ",
  "Get assistance in your preferred language: English, French, Vietnamese, or Mandarin Chinese.": "Nhận hỗ trợ bằng ngôn ngữ bạn ưa thích: Tiếng Anh, Tiếng Pháp, Tiếng Việt hoặc Tiếng Trung Quan Thoại.",
  "Simple Process": "Quy trình đơn giản",
  "How Immentra Works": "Immentra hoạt động như thế nào",
  "Your journey to Canada made simple in just three easy steps.": "Hành trình đến Canada của bạn được đơn giản hóa chỉ trong ba bước dễ dàng.",
  "Answer Simple Questions": "Trả lời câu hỏi đơn giản",
  "Our AI assistant will guide you through a series of easy-to-answer questions about your personal information, work experience, and immigration goals.": "Trợ lý AI của chúng tôi sẽ hướng dẫn bạn qua một loạt câu hỏi dễ trả lời về thông tin cá nhân, kinh nghiệm làm việc và mục tiêu nhập cư của bạn.",
  "Review Your Information": "Xem lại thông tin của bạn",
  "Once you've provided all necessary details, our system will compile and organize your information for review, ensuring everything is accurate.": "Khi bạn đã cung cấp tất cả chi tiết cần thiết, hệ thống của chúng tôi sẽ biên soạn và tổ chức thông tin của bạn để xem xét, đảm bảo mọi thứ đều chính xác.",
  "Download Completed Forms": "Tải xuống biểu mẫu đã hoàn thành",
  "After reviewing your information, our system generates properly filled application forms that you can download, print, and submit to Canadian immigration authorities.": "Sau khi xem xét thông tin của bạn, hệ thống của chúng tôi tạo ra các biểu mẫu đơn được điền đúng cách mà bạn có thể tải xuống, in và nộp cho cơ quan nhập cư Canada.",
  "Start Your Journey": "Bắt đầu hành trình của bạn",
  "Ready to make Canada your new home?": "Sẵn sàng biến Canada thành ngôi nhà mới của bạn?",
  "Get started with Immentra — a smarter way to complete your Canadian study permit application using AI-driven guidance and form automation.": "Bắt đầu với Immentra — cách thông minh hơn để hoàn thành đơn xin giấy phép học tập Canada của bạn bằng hướng dẫn AI và tự động hóa biểu mẫu.",
  "For international students who want to study in Canada": "Dành cho sinh viên quốc tế muốn học tập tại Canada",
  "Navigate the Study permit application process with AI assistance.": "Điều hướng quy trình xin giấy phép học tập với sự hỗ trợ của AI.",
  "For temporary work opportunities in Canada": "Dành cho cơ hội việc làm tạm thời tại Canada",
  "Navigate the work permit application process with AI assistance.": "Điều hướng quy trình xin giấy phép lao động với sự hỗ trợ của AI.",
  "For long-term immigration to Canada": "Dành cho nhập cư dài hạn đến Canada",
  "Comprehensive guidance for permanent residence applications.": "Hướng dẫn toàn diện cho đơn xin thường trú nhân.",
  "Creating...": "Đang tạo...",
  "Select": "Chọn",
  "Coming Soon": "Sắp ra mắt",
  "Starting Process...": "Đang bắt đầu quy trình...",
  "Start Process": "Bắt đầu quy trình",
  "Please login first": "Vui lòng đăng nhập trước",
  "Connect with licensed immigration consultants for professional advice when needed.": "Kết nối với các tư vấn viên nhập cư có giấy phép để được tư vấn chuyên nghiệp khi cần thiết."
}
